# 23.07.2022
# Шлепенков Алексей
# Telegram: @avesanties
# Discord: Alexey Sh.#3490
# e-mail: schlepenkow@gmail.com

# Задайте последовательность чисел.
# Напишите программу, которая выведет список
# неповторяющихся элементов исходной последовательности.

seq = {12,15,3,15,13,1,68,60,11,1,47,12}

list_from_seq = [x for x in seq]
print(list_from_seq)